app/models/customer.rb

INSERT INTO "customers" ("name", "email", "identification_code", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def self.create_or_update_from_bunny(payload)
    customer = find_or_initialize_by(email: payload['email'])
    customer.assign_attributes(
      name: payload['name'],
      identification_code: payload['identification_code']
    )
    customer.save!