app/models/service_order.rb

SELECT "customers".* FROM "customers" WHERE "customers"."email" = $1 LIMIT $2  [["email", "daniel@gmail.com"], ["LIMIT", 1]]
---
  def self.generator(params)
    customer = Customer.find_by_email(params.delete(:email))